In [1]:
import pandas as pd

In [2]:
a=[10,20,30,40,50]
sril = pd.Series(a)
print(sril.values)
print(sril.value_counts)
print(sril.dtype)

[10 20 30 40 50]
<bound method IndexOpsMixin.value_counts of 0    10
1    20
2    30
3    40
4    50
dtype: int64>
int64

In [3]:
b={'홍길동':70, '김승현':85, '박정혁':80}
s1=pd.Series(b)
print(s1)
s1.index=['hong', 'kim', 'park']
print(s1.index)
print(s1.values)

홍길동    70
김승현    85
박정혁    80
dtype: int64
Index(['hong', 'kim', 'park'], dtype='object')
[70 85 80]

In [4]:
print(s1['hong'])
print(s1[['hong', 'park']])
print(s1*10)

70
hong    70
park    80
dtype: int64
hong    700
kim     850
park    800
dtype: int64

In [5]:
names = ['kim', 'lee', 'choi', 'park', 'jung']
years = [2013, 2014, 2013, 2015, 2014]
points = [1.5, 1.7, 3.6, 2.4, 2.5]

In [6]:
data=[names, years, points]
df1=pd.DataFrame(data).T
df1.columns=['name', 'year', 'point']
df1.index=['one', 'two', 'three', 'fore', 'five']
df1

       name  year point
one     kim  2013   1.5
two     lee  2014   1.7
three  choi  2013   3.6
fore   park  2015   2.4
five   jung  2014   2.5

In [7]:
df2 = df1[['year', 'point']]
df2.describe()

        year  point
count      5    5.0
unique     3    5.0
top     2013    1.5
freq       2    1.0

In [8]:
# df1.info()
df1['point'] = df1['point'].astype('float32')
df1['year'] = df1['year'].astype('int64')
df1.describe()

             year     point
count     5.00000  5.000000
mean   2013.80000  2.340000
std       0.83666  0.826438
min    2013.00000  1.500000
25%    2013.00000  1.700000
50%    2014.00000  2.400000
75%    2014.00000  2.500000
max    2015.00000  3.600000

In [9]:
name = df1.name
print(name)
print(name.to_list())

one       kim
two       lee
three    choi
fore     park
five     jung
Name: name, dtype: object
['kim', 'lee', 'choi', 'park', 'jung']

In [10]:
df1[['name', 'point']]

       name  point
one     kim    1.5
two     lee    1.7
three  choi    3.6
fore   park    2.4
five   jung    2.5

In [11]:
df1['penalty'] = [0.5,0.1, 0.3, 0.2, 0.5]
df1['aa'] = [1,2,3,4,5]
print(df1['aa'])
print(df1.aa)

one      1
two      2
three    3
fore     4
five     5
Name: aa, dtype: int64
one      1
two      2
three    3
fore     4
five     5
Name: aa, dtype: int64

In [12]:
# df1.loc['one':'fore', ['name','point']]
# df1.iloc[0:4]
df1.iloc[2:4, 0:3]

       name  year  point
three  choi  2013    3.6
fore   park  2015    2.4

In [13]:
df5 = df1.drop(['one', 'fore']); df5

       name  year  point  penalty  aa
two     lee  2014    1.7      0.1   2
three  choi  2013    3.6      0.3   3
five   jung  2014    2.5      0.5   5

In [14]:
# df6 = df1.drop('aa', axis=1); df6 axis=1 칼럼삭제
df7 = df1.drop('one', axis=0); df7 # axis=0 행 삭제

       name  year  point  penalty  aa
two     lee  2014    1.7      0.1   2
three  choi  2013    3.6      0.3   3
fore   park  2015    2.4      0.2   4
five   jung  2014    2.5      0.5   5

In [15]:
df1.max(axis=0)

name       park
year       2015
point       3.6
penalty     0.5
aa            5
dtype: object

In [16]:
input_file = 'data/input.csv'
output_file = 'data/output.csv'

In [17]:
df = pd.read_csv(input_file)
df

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  $500,000    2014-01-20
1              A       001-1001         5467    500000    2014-01-20
2              A       001-1001         5407    750000    2014-01-20
3              A       001-1001         2341    750000    2014-01-20
4              B        50-9501         7009    250000    2018-01-30
5              B        50-9501         7009    250000    2018-01-30
6              B        50-9505         6650    125000    2017-02-03
7              B        50-9505         6650    125000    2017-02-03
8              C       920-4803         3321    615000    2017-02-03
9              C       920-4804         3321    615000    2017-02-10
10             C       920-4805         3321    615000    2017-02-17
11             C       920-4806         3321    615000    2017-02-24

In [18]:
df['Cost'] = df['Cost'].str.strip('$').str.replace(',', '').astype(float)
df

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  500000.0    2014-01-20
1              A       001-1001         5467  500000.0    2014-01-20
2              A       001-1001         5407  750000.0    2014-01-20
3              A       001-1001         2341  750000.0    2014-01-20
4              B        50-9501         7009  250000.0    2018-01-30
5              B        50-9501         7009  250000.0    2018-01-30
6              B        50-9505         6650  125000.0    2017-02-03
7              B        50-9505         6650  125000.0    2017-02-03
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24

In [19]:
result1 = df.loc[(df['Cost']>=600000) & (df['Supplier Name'] == 'A')]
result1

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
2             A       001-1001         5407  750000.0    2014-01-20
3             A       001-1001         2341  750000.0    2014-01-20

In [20]:
result2 = df.loc[(df['Cost'] >= 500000) & (df['Cost'] <= 700000)]
result2

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  500000.0    2014-01-20
1              A       001-1001         5467  500000.0    2014-01-20
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24

In [21]:
result3 = df.groupby('Supplier Name')['Cost'].mean()
result3

Supplier Name
A    625000.0
B    187500.0
C    615000.0
Name: Cost, dtype: float64

In [22]:
result2.to_csv(output_file, index=False)

In [26]:
df['Cost'].corr(df['Part Number'])

-0.7828086965160458

In [27]:
df.corr()

ValueError: could not convert string to float: 'A'